Repository: nextcloud/cookbook
Catalog: translationfiles/*/cookbook.po
Languages: de

source: Path to your recipe collection
de: Pfad zur Rezept-Sammlung

source: Could not set recipe folder to {path}
de: Konnte den Pfad '{path}' nicht als Rezept-Ordner setzen

source: Please pick a recipe
de: Bitte ein Rezept auswählen

source: Could not load recipe
de: Konnte Rezept nicht laden

source: Could not update recipe
de: Konnte Rezept nicht aktualisieren

source: Could not add recipe
de: Konnte Rezept nicht hinzufügen

source: Could not rebuild recipe index.
de: Konnte den Rezept-Index nicht neu aufbauen.

source: Are you sure you want to delete this recipe?
de: Soll das Rezept wirklich gelöscht werden?

source: Failed to delete recipe
de: Löschen des Rezepts ist fehlgeschlagen

source: Failed to fetch recipes
de: Laden der Rezepte ist fehlgeschlagen

source: Cookbook
de: Kochbuch

source: An integrated cookbook using schema.org JSON files as recipes
de: Ein integriertes Kochbuch, das schema.org JSON Dateien als Speicher für Rezepte nutzt

source: A library for all your recipes. It uses JSON files following the schema.org recipe format. To add a recipe to the collection, you can paste in the URL of the recipe, and the provided web page will be parsed and downloaded to whichever folder you specify in the app settings.
de: Eine Bibliothek aller Rezepte. Sie nutzt JSON Dateien, die dem schema.org Standard für Rezepte folgen. Um weitere Rezepte zu der Sammlung hinzuzufügen, kann die URL des Rezepts eingefügt werden, so dass die Seite heruntergeladen, verarbeitet und in einem benutzerspezifizierten Verzeichnis abgelegt wird.

source: Image URL
de: Bild-URL

source: Keywords (comma-separated)
de: Schlagworte (durch Kommas getrennt)

source: Servings
de: Portionen

source: Beans and legumes
de: Bohnen und Hülsenfrüchte

source: Berries
de: Beeren

source: Cruciferous vegetables
de: Kreuzblütler-Gemüse (z.B. Kohl, Brokkoli oder Radieschen)

source: Flaxseeds
de: Leinsamen

source: Greens
de: Blattgemüse

source: Nuts and seeds
de: Nüsse und Samen

source: Other fruits
de: Andere Früchte

source: Other vegetables
de: Andere Gemüsesorten

source: Herbs and spices
de: Kräuter und Gewürze

source: Whole grains
de: Vollkorn

source: Ingredients
de: Zutaten

source: Instructions
de: Anweisungen

source: Save
de: Speichern

source: One serving
de: Eine Portion

source: Create recipe
de: Neues Rezept anlegen

source: Recipe URL
de: Rezept-URL

source: Download recipe
de: Rezept herunterladen

source: Search
de: Suche

source: Edit recipe
de: Rezept bearbeiten

source: Delete recipe
de: Rezept löschen

source: Settings
de: Einstellungen

source: Rescan library
de: Bibliothek neu einlesen

source: Recipe folder
de: Rezept-Ordner

source: Please pick a folder
de: Bitte einen Ordner auswählen

source: Description
de: Beschreibung

source: Source URL
de: Quell-URL

source: Prep Time
de: Vorbereitungsdauer

source: Cook Time
de: Kochdauer

source: Print recipe
de: Rezept drucken

source: Source
de: Ursprung

source: Preparation time
de: Vorbereitungsdauer

source: Cooking time
de: Kochdauer
