{ "translations": {
    "No image with the matching MIME type was found on the server." : "ບໍ່ພົບຮູບພາບທີ່ມີປະເພດ MIME ທີ່ກົງກັນຢູ່ໃນເຊີບເວີ.",
    "The provided URL is not allowed." : "URL ທີ່ສະໜອງໃຫ້ບໍ່ໄດ້ຮັບອະນຸຍາດ.",
    "Recipe with ID %d was not found in database." : "ບໍ່ພົບສູດອາຫານທີ່ມີໄອດີ %d ໃນຖານຂໍ້ມູນ.",
    "Downloading of a file failed returned the following error message: %s" : "ການດາວໂຫຼດໄຟລ໌ລົ້ມເຫລວ ສົ່ງຄືນຂໍ້ຄວາມຜິດພາດດັ່ງນີ້: %s",
    "No content encoding was detected in the content." : "ບໍ່ພົບການເຂົ້າລະຫັດເນື້ອຫາໃດໆໃນເນື້ອຫານັ້ນ.",
    "Recipe name cannot be processed." : "ບໍ່ສາມາດປະມວນຜົນຊື່ສູດອາຫານໄດ້.",
    "The given image for the recipe %s cannot be parsed. Aborting and skipping it." : "ບໍ່ສາມາດວິເຄາະຮູບພາບທີ່ໃຫ້ໄວ້ສຳລັບສູດອາຫານ %s ໄດ້. ກຳລັງຍົກເລີກ ແລະ ຂ້າມມັນໄປ.",
    "No valid recipe was left after heuristics of recipe %s." : "ບໍ່ມີສູດອາຫານທີ່ຖືກຕ້ອງເຫຼືອຢູ່ ຫຼັງຈາກການວິເຄາະສູດອາຫານ %s.",
    "Heuristics failed for image extraction of recipe %s." : "ການວິເຄາະເພື່ອສະກັດຮູບພາບຂອງສູດອາຫານ %s ລົ້ມເຫລວ.",
    "Could not guess image URL as no recipe URL was found." : "ບໍ່ສາມາດຄາດເດົາ URL ຂອງຮູບພາບໄດ້ ເນື່ອງຈາກບໍ່ພົບ URL ຂອງສູດອາຫານ.",
    "Could not guess image URL scheme from recipe URL %s" : "ບໍ່ສາມາດຄາດເດົາຮູບແບບ URL ຂອງຮູບພາບຈາກ URL ຂອງສູດອາຫານ %s ໄດ້",
    "Could not parse recipe ingredients. It is no array." : "ບໍ່ສາມາດວິເຄາະສ່ວນປະກອບຂອງສູດອາຫານໄດ້. ມັນບໍ່ແມ່ນອາເຣ.",
    "Could not parse recipe instructions as they are no array." : "ບໍ່ສາມາດວິເຄາະຄຳແນະນຳສູດອາຫານໄດ້ ເນື່ອງຈາກພວກມັນບໍ່ແມ່ນອາເຣ.",
    "Cannot parse recipe: Unknown object found during flattening of instructions." : "ບໍ່ສາມາດວິເຄາະສູດອາຫານໄດ້: ພົບອັອບເຈັກທີ່ບໍ່ຮູ້ຈັກໃນລະຫວ່າງການຈັດຮຽງຄຳແນະນຳ.",
    "Did not find any p or li entries in the raw string of the instructions." : "ບໍ່ພົບລາຍການ p ຫຼື li ໃດໆໃນຂໍ້ຄວາມດິບຂອງຄຳແນະນຳ.",
    "Could not parse the keywords for recipe {recipe}." : "ບໍ່ສາມາດວິເຄາະຄຳສຳຄັນສຳລັບສູດອາຫານ {recipe} ໄດ້.",
    "Could not parse the nutrition information successfully for recipe {name}." : "ບໍ່ສາມາດວິເຄາະຂໍ້ມູນໂພຊະນາການສຳລັບສູດອາຫານ {name} ໄດ້ສຳເລັດ.",
    "Using heuristics to parse the \"recipeYield\" field representing the number of servings of recipe {name}." : "ກຳລັງໃຊ້ການວິເຄາະເພື່ອແຍກສ່ວນຊ່ອງຂໍ້ມູນ \"recipeYield\" ທີ່ສະແດງເຖິງຈຳນວນຄັ້ງທີ່ຮັບປະທານຂອງສູດອາຫານ {name}.",
    "_Only a single number was found in the \"recipeYield\" field. Using it as number of servings._::_There are %n numbers found in the \"recipeYield\" field. Using the highest number found as number of servings._" : ["ພົບພຽງຕົວເລກດຽວໃນຊ່ອງຂໍ້ມູນ \"recipeYield\". ກຳລັງໃຊ້ມັນເປັນຈຳນວນຄັ້ງທີ່ຮັບປະທານ."],
    "Could not parse \"recipeYield\" field. Falling back to 1 serving." : "ບໍ່ສາມາດວິເຄາະຊ່ອງຂໍ້ມູນ \"recipeYield\" ໄດ້. ກຳລັງກັບໄປໃຊ້ 1 ຄັ້ງທີ່ຮັບປະທານ.",
    "Could not parse recipe tools. Expected array or string." : "ບໍ່ສາມາດວິເຄາະອຸປະກອນສູດອາຫານໄດ້. ຄາດວ່າຈະເປັນອາເຣ ຫຼື ສະຕຣິງ.",
    "Could not find recipe in HTML code." : "ບໍ່ພົບສູດອາຫານໃນລະຫັດ HTML.",
    "JSON cannot be decoded." : "ບໍ່ສາມາດຖອດລະຫັດ JSON ໄດ້.",
    "No recipe was found." : "ບໍ່ພົບສູດອາຫານ.",
    "Cannot combine whitespace characters." : "ບໍ່ສາມາດລວມຕົວອັກສອນຍະຫວ່າງໄດ້.",
    "Parsing of HTML failed." : "ການວິເຄາະ HTML ລົ້ມເຫລວ.",
    "Unsupported error level during parsing of XML output." : "ລະດັບຄວາມຜິດພາດບໍ່ຮອງຮັບໃນລະຫວ່າງການວິເຄາະຜົນລັບ XML.",
    "_Warning %u occurred while parsing %s._::_Warning %u occurred %n times while parsing %s._" : ["ຄຳເຕືອນ %u ເກີດຂຶ້ນໃນຂະນະທີ່ວິເຄາະ %s."],
    "_Error %u occurred while parsing %s._::_Error %u occurred %n times while parsing %s._" : ["ຂໍ້ຜິດພາດ %u ເກີດຂຶ້ນໃນຂະນະທີ່ວິເຄາະ %s."],
    "_Fatal error %u occurred while parsing %s._::_Fatal error %u occurred %n times while parsing %s._" : ["ຂໍ້ຜິດພາດຮ້າຍແຮງ %u ເກີດຂຶ້ນໃນຂະນະທີ່ວິເຄາະ %s."],
    "First time it occurred in line %u and column %u" : "ຄັ້ງທຳອິດທີ່ມັນເກີດຂຶ້ນແມ່ນຢູ່ແຖວທີ %u ແລະ ຖັນທີ %u",
    "Could not parse duration {duration}" : "ບໍ່ສາມາດວິເຄາະໄລຍະເວລາ {duration} ໄດ້",
    "The recipe has already an image file. Cannot create a new one." : "ສູດອາຫານມີໄຟລ໌ຮູບພາບຢູ່ແລ້ວ. ບໍ່ສາມາດສ້າງໄຟລ໌ໃໝ່ໄດ້.",
    "There is no primary image for the recipe present." : "ບໍ່ມີຮູບພາບຫຼັກສຳລັບສູດອາຫານນີ້.",
    "Cannot parse non-POST multipart encoding. This is a bug." : "ບໍ່ສາມາດວິເຄາະການເຂົ້າລະຫັດ multipart ທີ່ບໍ່ແມ່ນ POST ໄດ້. ນີ້ແມ່ນບັກ.",
    "Unsupported type of transmitted data. This is a bug, please report it." : "ປະເພດຂໍ້ມູນທີ່ສົ່ງມາບໍ່ຮອງຮັບ. ນີ້ແມ່ນບັກ, ກະລຸນາລາຍງານ.",
    "Cannot detect type of transmitted data. This is a bug, please report it." : "ບໍ່ສາມາດກວດຫາປະເພດຂໍ້ມູນທີ່ສົ່ງມາໄດ້. ນີ້ແມ່ນບັກ, ກະລຸນາລາຍງານ.",
    "Invalid URL-encoded string found. Please report a bug." : "ພົບຂໍ້ຄວາມທີ່ເຂົ້າລະຫັດ URL ບໍ່ຖືກຕ້ອງ. ກະລຸນາລາຍງານບັກ.",
    "Could not parse timestamp {timestamp}" : "ບໍ່ສາມາດວິເຄາະສະແຕມເວລາ {timestamp} ໄດ້",
    "The user is not logged in. No user configuration can be obtained." : "ຜູ້ໃຊ້ບໍ່ໄດ້ເຂົ້າສູ່ລະບົບ. ບໍ່ສາມາດຮັບການຕັ້ງຄ່າຂອງຜູ້ໃຊ້ໄດ້.",
    "Recipes" : "ສູດອາຫານ",
    "The user folder cannot be created due to missing permissions." : "ບໍ່ສາມາດສ້າງໂຟນເດີຂອງຜູ້ໃຊ້ໄດ້ ເນື່ອງຈາກບໍ່ມີສິດອະນຸຍາດ.",
    "The configured user folder is a file." : "ໂຟນເດີຜູ້ໃຊ້ທີ່ຕັ້ງຄ່າໄວ້ເປັນໄຟລ໌.",
    "User cannot create recipe folder" : "ຜູ້ໃຊ້ບໍ່ສາມາດສ້າງໂຟນເດີສູດອາຫານໄດ້",
    "in %s" : "ໃນ %s",
    "Cannot read content of JSON file %s" : "ບໍ່ສາມາດອ່ານເນື້ອໃນຂອງໄຟລ໌ JSON %s ໄດ້",
    "The JSON file in the folder with ID %d does not have a valid name." : "ໄຟລ໌ JSON ໃນໂຟນເດີທີ່ມີໄອດີ %d ມີຊື່ບໍ່ຖືກຕ້ອງ.",
    "Could not parse URL" : "ບໍ່ສາມາດວິເຄາະ URL ໄດ້",
    "Exception while downloading recipe from %s.: %s" : "ຂໍ້ຍົກເວັ້ນໃນຂະນະດາວໂຫຼດສູດອາຫານຈາກ %s.: %s",
    "Download from %s failed as HTTP status code %d is not in expected range." : "ການດາວໂຫຼດຈາກ %s ລົ້ມເຫລວ ເນື່ອງຈາກລະຫັດສະຖານະ HTTP %d ບໍ່ຢູ່ໃນຂອບເຂດທີ່ຄາດໄວ້.",
    "Could not find a valid encoding when parsing %s." : "ບໍ່ພົບການເຂົ້າລະຫັດທີ່ຖືກຕ້ອງເມື່ອວິເຄາະ %s.",
    "No parser found for the given import." : "ບໍ່ພົບໂຕວິເຄາະສຳລັບການນຳເຂົ້າທີ່ໃຫ້ໄວ້.",
    "No recipe name was given. A unique name is required to store the recipe." : "ບໍ່ມີການລະບຸຊື່ສູດອາຫານ. ຕ້ອງໃຊ້ຊື່ທີ່ບໍ່ຊໍ້າກັນເພື່ອເກັບຮັກສາສູດອາຫານ.",
    "Unexpected node received for recipe folder." : "ໄດ້ຮັບໂນດທີ່ບໍ່ຄາດຄິດສຳລັບໂຟນເດີສູດອາຫານ.",
    "Another recipe with that name already exists" : "ມີສູດອາຫານອື່ນທີ່ມີຊື່ນັ້ນຢູ່ແລ້ວ",
    "Cannot download image using curl" : "ບໍ່ສາມາດດາວໂຫຼດຮູບພາບໂດຍໃຊ້ curl ໄດ້",
    "No recipe data found. This is a bug" : "ບໍ່ພົບຂໍ້ມູນສູດອາຫານ. ນີ້ແມ່ນບັກ",
    "Recipe with ID %d not found." : "ບໍ່ພົບສູດອາຫານທີ່ມີໄອດີ %d.",
    "Image size \"%s\" is not recognized." : "ບໍ່ຮູ້ຈັກຂະໜາດຮູບພາບ \"%s\".",
    "The full-sized image is not a thumbnail." : "ຮູບພາບຂະໜາດເຕັມບໍ່ແມ່ນຮູບຫຍໍ້.",
    "The thumbnail type %d is not known." : "ບໍ່ຮູ້ຈັກປະເພດຮູບຫຍໍ້ %d.",
    "Cookbook" : "ປຶ້ມສູດອາຫານ",
    "An integrated cookbook using schema.org JSON files as recipes" : "ປຶ້ມສູດອາຫານແບບປະສົມປະສານທີ່ໃຊ້ໄຟລ໌ schema.org JSON ເປັນສູດອາຫານ",
    "A library for all your recipes. It uses JSON files following the schema.org recipe format. To add a recipe to the collection, you can paste in the URL of the recipe, and the provided web page will be parsed and downloaded to whichever folder you specify in the app settings." : "ຫໍສະໝຸດສຳລັບສູດອາຫານທັງໝົດຂອງທ່ານ. ມັນໃຊ້ໄຟລ໌ JSON ຕາມຮູບແບບສູດອາຫານຂອງ schema.org. ເພື່ອເພີ່ມສູດອາຫານເຂົ້າໃນຄໍເລັກຊັນ, ທ່ານສາມາດວາງ URL ຂອງສູດອາຫານ, ແລະ ໜ້າເວັບທີ່ສະໜອງໃຫ້ຈະຖືກວິເຄາະ ແລະ ດາວໂຫຼດໄປຍັງໂຟນເດີໃດກໍ່ຕາມທີ່ທ່ານລະບຸໃນການຕັ້ງຄ່າແອັບ.",
    "Category" : "ໝວດໝູ່",
    "Recipe name" : "ຊື່ສູດອາຫານ",
    "Tags" : "ປ້າຍກຳກັບ",
    "Search for recipes" : "ຄົ້ນຫາສູດອາຫານ",
    "Are you sure you want to delete this recipe?" : "ເຈົ້າແນ່ໃຈບໍ່ວ່າຕ້ອງການລຶບສູດອາຫານນີ້?",
    "Delete failed" : "ການລຶບລົ້ມເຫລວ",
    "Editing recipe" : "ກຳລັງແກ້ໄຂສູດອາຫານ",
    "Viewing recipe" : "ກຳລັງເບິ່ງສູດອາຫານ",
    "All recipes" : "ສູດອາຫານທັງໝົດ",
    "None" : "ບໍ່ມີ",
    "Loading app" : "ກຳລັງໂຫຼດແອັບ",
    "Loading recipe" : "ກຳລັງໂຫຼດສູດອາຫານ",
    "Recipe not found" : "ບໍ່ພົບສູດອາຫານ",
    "Page not found" : "ບໍ່ພົບຫນ້າ",
    "Creating new recipe" : "ກຳລັງສ້າງສູດອາຫານໃໝ່",
    "Edit" : "ແກ້ໄຂ",
    "Save" : "ບັນທຶກ",
    "Search" : "ຄົ້ນຫາ",
    "Filter current recipes" : "ກັ່ນຕອງສູດອາຫານປັດຈຸບັນ",
    "Filter" : "ໂຕກອງ",
    "Search recipes" : "ຄົ້ນຫາສູດອາຫານ",
    "Reload recipe" : "ໂຫຼດສູດອາຫານຄືນໃໝ່",
    "Abort editing" : "ຍົກເລີກການແກ້ໄຂ",
    "Print recipe" : "ພິມສູດອາຫານ",
    "Clone recipe" : "ສຳເນົາສູດອາຫານ",
    "Delete recipe" : "ລຶບສູດອາຫານ",
    "Path to your recipe collection" : "ເສັ້ນທາງໄປຫາຄໍເລັກຊັນສູດອາຫານຂອງທ່ານ",
    "Cannot access recipe folder." : "ບໍ່ສາມາດເຂົ້າເຖິງໂຟນເດີສູດອາຫານໄດ້.",
    "Select recipe folder" : "ເລືອກໂຟນເດີສູດອາຫານ",
    "You are logged in with a guest account. Therefore, you are not allowed to generate arbitrary files and folders on this Nextcloud instance. To be able to use the Cookbook app as a guest, you need to specify a folder where all recipes are stored. You will need write permission to this folder." : "ທ່ານກຳລັງເຂົ້າສູ່ລະບົບດ້ວຍບັນຊີແຂກ. ດັ່ງນັ້ນ, ທ່ານບໍ່ໄດ້ຮັບອະນຸຍາດໃຫ້ສ້າງໄຟລ໌ ແລະ ໂຟນເດີຕ່າງໆໃນ Nextcloud ນີ້. ເພື່ອທີ່ຈະສາມາດໃຊ້ແອັບ Cookbook ໃນຖານະແຂກ, ທ່ານຈຳເປັນຕ້ອງລະບຸໂຟນເດີທີ່ສູດອາຫານທັງໝົດຖືກເກັບໄວ້. ທ່ານຈະຕ້ອງມີສິດໃນການຂຽນໃສ່ໂຟນເດີນີ້.",
    "Failed to load category {category} recipes" : "ໂຫຼດສູດອາຫານໝວດໝູ່ {category} ລົ້ມເຫລວ",
    "Failed to update name of category \"{category}\"" : "ອັບເດດຊື່ຂອງໝວດໝູ່ \"{category}\" ລົ້ມເຫລວ",
    "The server reported an error. Please check." : "ເຊີບເວີລາຍງານຂໍ້ຜິດພາດ. ກະລຸນາກວດສອບ.",
    "Could not query the server. This might be a network problem." : "ບໍ່ສາມາດສອບຖາມເຊີບເວີໄດ້. ນີ້ອາດຈະເປັນບັນຫາເຄືອຂ່າຍ.",
    "Loading category recipes …" : "ກຳລັງໂຫຼດສູດອາຫານໃນໝວດໝູ່…",
    "Failed to fetch categories" : "ດຶງຂໍ້ມູນໝວດໝູ່ລົ້ມເຫລວ",
    "Create recipe" : "ສ້າງສູດອາຫານ",
    "Download recipe from URL" : "ດາວໂຫຼດສູດອາຫານຈາກ URL",
    "Uncategorized recipes" : "ສູດອາຫານທີ່ບໍ່ມີໝວດໝູ່",
    "Categories" : "ໝວດໝູ່",
    "Rename" : "ປ່ຽນຊື່",
    "Enter new category name" : "ໃສ່ຊື່ໝວດໝູ່ໃໝ່",
    "Cookbook settings" : "ການຕັ້ງຄ່າປຶ້ມສູດອາຫານ",
    "Path to your recipe image" : "ເສັ້ນທາງໄປຫາຮູບພາບສູດອາຫານຂອງທ່ານ",
    "Enter URL or select from your Nextcloud instance on the right" : "ໃສ່ URL ຫຼືເລືອກຈາກ Nextcloud ຂອງທ່ານຢູ່ເບື້ອງຂວາ",
    "Pick a local image" : "ເລືອກຮູບພາບໃນເຄື່ອງ",
    "Name" : "ຊື່",
    "Creation date" : "ວັນທີສ້າງ",
    "Modification date" : "ວັນທີແກ້ໄຂ",
    "_{hours}h_::_{hours}h_" : ["{hours} ຊມ"],
    "_{minutes}m_::_{minutes}m_" : ["{minutes} ນທ"],
    "_{seconds}s_::_{seconds}s_" : ["{seconds} ວ"],
    "Loading recipe failed" : "ການໂຫຼດສູດອາຫານລົ້ມເຫລວ",
    "{item} copied to clipboard" : "ສຳເນົາ {item} ໄປທີ່ຄລິບບອດແລ້ວ",
    "Copying {item} to clipboard failed" : "ການສຳເນົາ {item} ໄປທີ່ຄລິບບອດລົ້ມເຫລວ",
    "Ingredients" : "ສ່ວນປະກອບ",
    "ingredients" : "ສ່ວນປະກອບ",
    "Loading…" : "ກຳລັງໂຫຼດ…",
    "Search recipes with this keyword" : "ຄົ້ນຫາສູດອາຫານດ້ວຍຄຳສຳຄັນນີ້",
    "Date created" : "ວັນທີສ້າງ",
    "Last modified" : "ແກ້ໄຂຫຼ້າສຸດ",
    "Source" : "ແຫຼ່ງທີ່ມາ",
    "Servings" : "ຈຳນວນຄັ້ງທີ່ຮັບປະທານ",
    "Preparation time" : "ເວລາໃນການກະກຽມ",
    "Cooking time" : "ເວລາໃນການປຸງແຕ່ງ",
    "Total time" : "ເວລາທັງໝົດ",
    "Copy ingredients to the clipboard" : "ສຳເນົາສ່ວນປະກອບໄປທີ່ຄລິບບອດ",
    "Copy ingredients" : "ສຳເນົາສ່ວນປະກອບ",
    "Tools" : "ອຸປະກອນ",
    "Nutrition Information" : "ຂໍ້ມູນໂພຊະນາການ",
    "Serving Size" : "ຂະໜາດຮັບປະທານ",
    "Energy" : "ພະລັງງານ",
    "Sugar" : "ນ້ຳຕານ",
    "Carbohydrate" : "ຄາໂບໄຮເດຣດ",
    "Cholesterol" : "ຄໍເລສເຕີໂຣນ",
    "Fiber" : "ໃຍອາຫານ",
    "Protein" : "ໂປຣຕີນ",
    "Sodium" : "ໂຊດຽມ",
    "Fat total" : "ໄຂມັນທັງໝົດ",
    "Saturated Fat" : "ໄຂມັນອີ່ມຕົວ",
    "Unsaturated Fat" : "ໄຂມັນບໍ່ອີ່ມຕົວ",
    "Trans Fat" : "ໄຂມັນທຣານສ໌",
    "Instructions" : "ຂັ້ນຕອນການເຮັດ",
    "The ingredient cannot be recalculated due to incorrect syntax. Please ensure the syntax follows this format: amount unit ingredient and that a specific number of portions is set for this function to work correctly. Examples: 200 g carrots or 1 pinch of salt." : "ບໍ່ສາມາດຄຳນວນສ່ວນປະກອບຄືນໃໝ່ໄດ້ ເນື່ອງຈາກຮູບແບບບໍ່ຖືກຕ້ອງ. ກະລຸນາກວດສອບໃຫ້ແນ່ໃຈວ່າຮູບແບບເປັນໄປຕາມນີ້: ຈຳນວນ ໜ່ວຍວັດ ສ່ວນປະກອບ ແລະ ຕ້ອງໄດ້ກຳນົດຈຳນວນສ່ວນທີ່ຮັບປະທານໄວ້ເພື່ອໃຫ້ຟັງຊັນນີ້ເຮັດວຽກຢ່າງຖືກຕ້ອງ. ຕົວຢ່າງ: 200 ກຣາມ ຫົວຜັກກາດ ຫຼື ເກືອ 1 ຢິບມື.",
    "Failed to load recipes with keywords: {tags}" : "ໂຫຼດສູດອາຫານດ້ວຍຄຳສຳຄັນ: {tags} ລົ້ມເຫລວ",
    "Failed to load search results" : "ໂຫຼດຜົນການຄົ້ນຫາລົ້ມເຫລວ"
},"pluralForm" :"nplurals=1; plural=0;"
}