{ "translations": {
    "No image with the matching MIME type was found on the server." : "Na serveri sa nenašiel žiadny obrázok so zodpovedajúcim typom MIME.",
    "Recipe with ID %d was not found in database." : "Recept s ID %d nebol nájdený v databázi.",
    "Downloading of a file failed returned the following error message: %s" : "Sťahovanie súboru zlyhalo a vrátilo sa nasledujúce chybové hlásenie: %s",
    "No content encoding was detected in the content." : "V obsahu nebolo zistené žiadne kódovanie obsahu.",
    "The given image for the recipe %s cannot be parsed. Aborting and skipping it." : "Daný obrázok pre recept %s nie je možné analyzovať. Prerušujem a preskakujem.",
    "No valid recipe was left after heuristics of recipe %s." : "Po heuristike receptu nezostal žiadny platný recept %s.",
    "Heuristics failed for image extraction of recipe %s." : "Heuristika zlyhala pri extrakcii obrázka receptu %s.",
    "Could not guess image URL as no recipe URL was found." : "Nepodarilo sa uhádnuť adresu URL obrázka, pretože sa nenašla žiadna adresa URL receptu.",
    "Could not guess image URL scheme from recipe URL %s" : "Nepodarilo sa uhádnuť adresu URL obrázka z adresy URL receptu %s",
    "Could not parse recipe ingredients. It is no array." : "Nepodarilo sa analyzovať ingrediencie receptu. Nie je to pole.",
    "Could not parse recipe instructions as they are no array." : "Nepodarilo sa analyzovať inštrukcie k receptu. Nie je to pole.",
    "Cannot parse recipe: Unknown object found during flattening of instructions." : "Recept sa nedá analyzovať: Pri spracovávaní pokynov sa našiel neznámy objekt.",
    "Did not find any p or li entries in the raw string of the instructions." : "V nespracovanom reťazci pokynov sa nenašli žiadne položky p alebo li.",
    "Could not parse the keywords for recipe {recipe}." : "Nepodarilo sa spracovať kľúčové slová pre recept {recipe}.",
    "Could not parse the nutrition information successfully for recipe {name}." : "Nepodarilo sa spracovať výživové informácie pre recept {name}.",
    "Using heuristics to parse the \"recipeYield\" field representing the number of servings of recipe {name}." : "Použitie heuristiky na analýzu poľa \"recipeYield\" predstavujúce počet porcií receptu {name}.",
    "_Only a single number was found in the \"recipeYield\" field. Using it as number of servings._::_There are %n numbers found in the \"recipeYield\" field. Using the highest number found as number of servings._" : ["V poli \"recipeYield\" sa nachádza %n číslo. Použije sa najvyššie číslo nájdené ako počet porcií.","V poli \"recipeYield\" sa nachádzajú %n čísla. Použije sa najvyššie číslo nájdené ako počet porcií.","V poli \"recipeYield\" sa nachádza %n čísiel. Použije sa najvyššie číslo nájdené ako počet porcií.","V poli \"recipeYield\" sa nachádzajú %n čísla. Použije sa najvyššie číslo nájdené ako počet porcií."],
    "Could not parse \"recipeYield\" field. Falling back to 1 serving." : "Pole „recipeYield“ sa nepodarilo spracovať. Použije sa 1 porcia.",
    "Could not parse recipe tools. Expected array or string." : "Nepodarilo sa zistiť nástroje pre recept. Očakávané je pole alebo reťazec.",
    "Could not find recipe in HTML code." : "Nemôžem nájisť recept v HTML kóde.",
    "JSON cannot be decoded." : "Nemôžem dekódovať JSON.",
    "No recipe was found." : "Nenašiel sa žiadny recept.",
    "Parsing of HTML failed." : "Spracovanie HTML zlyhalo.",
    "Unsupported error level during parsing of XML output." : "Nepodporovaný typ chyby počas analýzy výstupu XML.",
    "_Warning %u occurred while parsing %s._::_Warning %u occurred %n times while parsing %s._" : ["Počas analýzy %s sa %n krát vyskytlo varovanie.","Počas analýzy %s sa %n krát vyskytlo varovanie.","Počas analýzy %s sa %n krát vyskytlo varovanie.","Počas analýzy %s sa %n krát vyskytlo varovanie."],
    "_Error %u occurred while parsing %s._::_Error %u occurred %n times while parsing %s._" : ["Počas spracovania %s sa vyskytla %n krát chyba %u.","Počas spracovania %s sa vyskytla %n krát chyba %u.","Počas spracovania %s sa vyskytla %n krát chyba %u.","Počas spracovania %s sa vyskytla %n krát chyba %u."],
    "_Fatal error %u occurred while parsing %s._::_Fatal error %u occurred %n times while parsing %s._" : ["Počas spracovania %s sa vyskytla %n krát fatálna chyba %u.","Počas spracovania %s sa vyskytla %n krát fatálna chyba %u.","Počas spracovania %s sa vyskytla %n krát fatálna chyba %u.","Počas spracovania %s sa vyskytla %n krát fatálna chyba %u."],
    "First time it occurred in line %u and column %u" : "Prvýkrát sa to stalo v riadku %u a stĺpci %u",
    "Could not parse duration {duration}" : "Nepodarilo sa spracovať trvanie {duration}",
    "The recipe has already an image file. Cannot create a new one." : "Recept už má súbor s obrázkom. Nemôžete vytvoriť nový.",
    "There is no primary image for the recipe present." : "Neexistuje žiadny primárny obrázok pre tento recept.",
    "Cannot parse non-POST multipart encoding. This is a bug." : "Nemôžem parsovať non-POST multipart encoding. Toto je chyba.",
    "Unsupported type of transmitted data. This is a bug, please report it." : "Nepodporovaný typ prenášaných údajov. Toto je chyba, nahláste ju.",
    "Cannot detect type of transmitted data. This is a bug, please report it." : "Nie je možné zistiť typ prenášaných údajov. Toto je chyba, prosím nahláste ju.",
    "Invalid URL-encoded string found. Please report a bug." : "Našiel sa neplatný reťazec zakódovaný do adresy URL. Nahláste chybu.",
    "Could not parse timestamp {timestamp}" : "Nepodarilo sa prečítať časovú značku {timestamp}",
    "The user is not logged in. No user configuration can be obtained." : "Užívateľ nie je prihlásený. Nemôže byť získaná žiadna užívateľská konfigurácia.",
    "Recipes" : "Recepty",
    "The user folder cannot be created due to missing permissions." : "Užívateľský priečinok nemožno vytvoriť z dôvodu chýbajúcich oprávnení.",
    "The configured user folder is a file." : "Nakonfigurovaný užívateľský priečinok je súbor.",
    "User cannot create recipe folder" : "Užívateľ nemôže vytvoriť priečinok receptov",
    "in %s" : "v %s",
    "Cannot read content of JSON file %s" : "Nedá sa prečítať obsah JSON súboru %s",
    "The JSON file in the folder with ID %d does not have a valid name." : "Súbor JSON v priečinku s ID %d nemá platný názov.",
    "Could not parse URL" : "Nemôžem spracovať adresu URL",
    "Exception while downloading recipe from %s." : "Výnimka pri sťahovaní receptu z %s.",
    "Download from %s failed as HTTP status code %d is not in expected range." : "Sťahovanie z %s zlyhalo, pretože stavový kód %d HTTP nie je v očakávanom rozsahu.",
    "Could not find a valid encoding when parsing %s." : "Pri spracovaní %s sa nepodarilo nájsť platné kódovanie.",
    "No parser found for the given import." : "Pre daný import sa nenašiel žiadny analyzátor.",
    "No recipe name was given. A unique name is required to store the recipe." : "Nebol uvedený žiadny názov receptu. Na uloženie receptu je potrebný jedinečný názov.",
    "Unexpected node received for recipe folder." : "Pre adresár receptov bol prijatý neočakávaný uzol.",
    "Another recipe with that name already exists" : "Iný recept s tým istým menom už existuje",
    "Cannot download image using curl" : "Nedá sa stiahnuť obrázok pomocou curl",
    "No recipe data found. This is a bug" : "Nenašli sa žiadne údaje o recepte. Toto je chyba",
    "Recipe with ID %d not found." : "Recept s ID %d nebol nájdený.",
    "Image size \"%s\" is not recognized." : "Nebola rozpoznaná veľkosť obrázku \"%s\".",
    "The full-sized image is not a thumbnail." : "Obrázok v plnej veľkosti nie je náhľad.",
    "The thumbnail type %d is not known." : "Typ náhľadu %d nebol rozpoznaný.",
    "Cookbook" : "Kuchárska kniha",
    "An integrated cookbook using schema.org JSON files as recipes" : "Integrovaná kuchárska kniha používa ako recepty súbory JSON schema.org",
    "A library for all your recipes. It uses JSON files following the schema.org recipe format. To add a recipe to the collection, you can paste in the URL of the recipe, and the provided web page will be parsed and downloaded to whichever folder you specify in the app settings." : "Knižnica pre všetky vaše recepty. Používa súbory JSON vo formáte receptov definovaných v schema.org. Ak chcete pridať recept, môžete ho pridať do URL receptu a poskytnutá webová stránka sa analyzuje a stiahne do ktoréhokoľvek priečinka, ktorý nastavíte v aplikácii.",
    "Category" : "Kategória",
    "Recipe name" : "Názov receptu",
    "Tags" : "Štítky",
    "Search for recipes" : "Hľadať recept",
    "Are you sure you want to delete this recipe?" : "Naozaj chcete odstrániť tento recept?",
    "Delete failed" : "Zmazanie zlyhalo",
    "Editing recipe" : "Editovanie receptu",
    "Viewing recipe" : "Prezeranie receptu",
    "All recipes" : "Všetky recepty",
    "None" : "Žiadne",
    "Loading app" : "Nahrávam aplikáciu",
    "Loading recipe" : "Recept sa nahráva",
    "Recipe not found" : "Recept nebol nájdený",
    "Page not found" : "Stránka nenájdená",
    "Creating new recipe" : "Vytváranie nového receptu",
    "Edit" : "Upraviť",
    "Save" : "Uložiť",
    "Search" : "Hľadať",
    "Filter current recipes" : "Filtrovať recepty",
    "Filter" : "Filter",
    "Search recipes" : "Vyhľadať recepty",
    "Reload recipe" : "Znovu načítať recept",
    "Abort editing" : "Zrušiť úpravu",
    "Print recipe" : "Vytlačiť recept",
    "Clone recipe" : "Klonovať recept",
    "Delete recipe" : "Vymazať recept",
    "Path to your recipe collection" : "Cesta k vašim receptom",
    "Cannot access recipe folder." : "Nemôžem pristúpiť k priečinku s receptami.",
    "Select recipe folder" : "Vyberte priečinok receptov",
    "You are logged in with a guest account. Therefore, you are not allowed to generate arbitrary files and folders on this Nextcloud instance. To be able to use the Cookbook app as a guest, you need to specify a folder where all recipes are stored. You will need write permission to this folder." : "Ste prihlásení pomocou účtu hosťa. Preto v tejto inštancii Nextcloud nemáte oprávnenie generovať ľubovoľné súbory a priečinky. Aby ste mohli aplikáciu Kuchárska kniha používať ako hosť, musíte určiť priečinok, kde sú uložené všetky recepty. Do tohto priečinka budete potrebovať povolenie na zápis.",
    "Failed to load category {category} recipes" : "Zlyhalo načítanie kategórie {category} receptov",
    "Failed to update name of category \"{category}\"" : "Úprava názvu kategórie \"{category}\" zlyhala",
    "Name" : "Názov",
    "Creation date" : "Dátum vytvorenia",
    "Modification date" : "Dátum zmeny"
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n == 1 ? 0 : n % 1 == 0 && n >= 2 && n <= 4 ? 1 : n % 1 != 0 ? 2: 3);"
}