OC.L10N.register(
    "cookbook",
    {
    "Home" : "Домашній",
    "Save changes" : "Зберегти зміни",
    "Loading…" : "Завантаження…",
    "Page not found" : "Сторінку не знайдено",
    "Filter" : "Фільтр",
    "Search" : "Пошук",
    "Category" : "Категорія",
    "Add" : "Додати",
    "Name" : "Ім'я",
    "Description" : "Опис",
    "URL" : "URL-адреса",
    "Tools" : "Інструменти"
},
"nplurals=4; plural=(n % 1 == 0 && n % 10 == 1 && n % 100 != 11 ? 0 : n % 1 == 0 && n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14) ? 1 : n % 1 == 0 && (n % 10 ==0 || (n % 10 >=5 && n % 10 <=9) || (n % 100 >=11 && n % 100 <=14 )) ? 2: 3);");
